app/controllers/api/comments_controller.rb

	def add_comment
		@comment = Comment.create(comment_params)
		@comment.user_id = comment_params.values_at(:user_id).first
		@comment.post_id = comment_params.values_at(:post_id).first
		@comment.content = comment_params.values_at(:content).first
		@comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 7], ["user_id", 4], ["content", "Nadine"], ["created_at", "2015-12-10 18:13:22.631775"], ["updated_at", "2015-12-10 18:13:22.631775"]]
UPDATE "comments" SET "user_id" = ?, "post_id" = ?, "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", nil], ["post_id", nil], ["content", "[\"Nadine\"]"], ["updated_at", "2015-12-10 18:13:54.785622"], ["id", 6]]