app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."timeline_id" = ?  [["timeline_id", 4]]
---
	def get_timeline
		@posts = (current_user.posts + Post.where(timeline_id: current_user.id)).uniq

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 4], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 4], ["accept", "t"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
	def get_newsfeed
		#all my posts and my friends posts sorted by create_at
  		my_posts = current_user.posts()
  		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		friends = Array.new
		f1.each do |i|
			friends.push(User.find(i.user_id))
		end
		f2.each do |i|
			friends.push(User.find(i.friend_id))
		end
		friends_posts = Array.new
		friends.each do |f|

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 5]]
---
	def get_related_comments
		@post = Post.find(post_params.values_at(:post_id)).first
		@comments = @post.comments.order("created_at DESC")

INSERT INTO "posts" ("user_id", "timeline_id", "genre", "book", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def new_quote
		@post = Post.create()

INSERT INTO "posts" ("user_id", "timeline_id", "genre", "book", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def new_status
		@post = Post.create()