app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "971580372902774"]]
---
	def get_current_user
		@user = User.find_by(uid: current_user.uid)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
	def get_user
		@user = User.find(get_user_params.values_at(:user_id)).first

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 4], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 4], ["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
	def get_friends
		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		@friends = Array.new
		f1.each do |i|
			@friends.push(User.find(i.user_id))

SELECT "friendships".* FROM "friendships" WHERE "friendships"."accept" = ? AND "friendships"."friend_id" = 5  [["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."accept" = ? AND "friendships"."user_id" = 5  [["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
	def friends_of_friend
		f_id = get_user_params.values_at(:user_id)
		f1 = Friendship.where(friend_id: f_id , accept: true)
		f2 = Friendship.where(user_id: f_id , accept: true)
		@friends = Array.new
		f1.each do |i|
			@friends.push(User.find(i.user_id))

DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 5]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ? AND "friendships"."user_id" = 5  [["friend_id", 4], ["accept", "t"]]
---
	def remove_friend
		f1 = Friendship.where(user_id: current_user.id , friend_id: get_user_params.values_at(:user_id) , accept: true).destroy_all

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" IS NULL  [["friend_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
	def requests
		@ids= Friendship.where(friend_id: current_user.id , accept: nil)
		@friend_request = Array.new
		@ids.each do |i|
			@friend_request.push(User.find(i.user_id))

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."user_id" = 5  [["friend_id", 4]]
---
	def accept
		f_id = get_user_params.values_at(:user_id)
		fs = Friendship.where(user_id: f_id , friend_id: current_user.id)

SELECT "users".* FROM "users" WHERE (name like '%["nad"]%')  ORDER BY created_at DESC
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["user_id", 4], ["friend_id", 5], ["accept", "t"]]
---
	def friends_search
		@people = User.search(search_params.values_at(:content).first).order("created_at DESC")
	    @friends = Array.new

	    @people.each do |p|
	    	if Friendship.where(user_id: current_user.id, friend_id: p.id , accept: true).length == 1 || Friendship.where(user_id: p.id, friend_id: current_user.id , accept: true).length == 1

SELECT "users".* FROM "users" WHERE (name like '%["nad"]%')  ORDER BY created_at DESC
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" IS NULL  [["user_id", 5], ["friend_id", 4]]
---
	def requests_search
		@people = User.search(search_params.values_at(:content).first).order("created_at DESC")
	    @requests = Array.new

	    @people.each do |p|
	    	if Friendship.where(user_id: p.id, friend_id: current_user.id , accept: nil).length == 1

SELECT "users".* FROM "users" WHERE (name like '%["nad"]%')  ORDER BY created_at DESC
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" IS NULL  [["user_id", 4], ["friend_id", 5]]
---
	def pending_search
		@people = User.search(search_params.values_at(:content).first).order("created_at DESC")
	    @pending = Array.new

	    @people.each do |p|
	    	if Friendship.where(user_id: current_user.id, friend_id: p.id , accept: nil).length == 1

SELECT "users".* FROM "users" WHERE (name like '%["nad"]%')  ORDER BY created_at DESC
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["user_id", 4], ["friend_id", 5], ["accept", "t"]]
---
	def not_friends_search
		@people = User.search(search_params.values_at(:content).first).order("created_at DESC")
	    @not_friends = Array.new

	    @people.each do |p|
	    if Friendship.where(user_id: current_user.id, friend_id: p.id , accept: nil).length == 1

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["friend_id", 8], ["created_at", "2015-12-12 01:04:59.379598"], ["updated_at", "2015-12-12 01:04:59.379598"]]
---
	def add_friend
		@request = Friendship.new
		@request.user_id = current_user.id
		@request.friend_id = get_user_params.values_at(:user_id).first
		@request.accept = nil
		#byebug
	  	@request.save