app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Comment #1 "], ["created_at", "2015-11-14 20:41:04.840093"], ["updated_at", "2015-11-14 20:41:04.840093"]]
UPDATE "comments" SET "user_id" = ?, "post_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 4], ["post_id", 7], ["updated_at", "2015-11-14 20:41:04.845328"], ["id", 1]]
---
	def create_comment
		@comment = Comment.create(comment_params)
		@comment.user_id = current_user.id
		@comment.post_id = params[:post_id].to_i
		@comment.save