app/controllers/posts_controller.rb

	def create_quote
		@post = current_user.posts.create(post_params)
		@post.genre = "quote"
		@post.timeline_id = session[:profile]
		@post.save
---
INSERT INTO "posts" ("book", "author", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["book", "Book #1"], ["author", "Author #1"], ["content", "Quote #1 fb - fb 2-2"], ["user_id", 2], ["created_at", "2015-11-14 20:01:28.947668"], ["updated_at", "2015-11-14 20:01:28.947668"]]
UPDATE "posts" SET "genre" = ?, "timeline_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["genre", "quote"], ["timeline_id", 4], ["updated_at", "2015-11-14 20:38:14.459534"], ["id", 5]]

	def create_review
		@post = current_user.posts.create(post_params)
		@post.genre = "review"
		@post.timeline_id = session[:profile]
		@post.save
---
INSERT INTO "posts" ("book", "author", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["book", "Book #2"], ["author", "Author #2"], ["content", "Review #1 t - t 5 - 5"], ["user_id", 5], ["created_at", "2015-11-14 20:39:15.213511"], ["updated_at", "2015-11-14 20:39:15.213511"]]
UPDATE "posts" SET "genre" = ?, "timeline_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["genre", "review"], ["timeline_id", 5], ["updated_at", "2015-11-14 20:39:15.216090"], ["id", 6]]

	def show
    	@post = Post.find(params[:id])
    	@comments = @post.comments.order("created_at DESC")
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 7]]