app/controllers/users_controller.rb

	def search
		if params[:search]
	      @people = User.search(params[:search]).order("created_at DESC")
	    end

	    @pending = Array.new
	    @friends = Array.new
	    @requested = Array.new
	    @not_friends = Array.new

	    @people.each do |p|
	    	if Friendship.where(user_id: current_user.id, friend_id: p.id , accept: nil).length == 1
---
SELECT "users".* FROM "users" WHERE (name like '%nad%')  ORDER BY created_at DESC
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["user_id", 2], ["friend_id", 2], ["accept", "t"]]

	def show
		@quote = true
		@user = User.find(params[:id])
		@posts = Post.where(user_id: params[:id]).order("created_at DESC")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]

	def add_friend
		@request = Friendship.new
		@request.user_id = current_user.id
		@request.friend_id = params[:friend_id].to_i
		@request.accept = nil
	  	@request.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["created_at", "2015-11-14 19:19:09.353568"], ["updated_at", "2015-11-14 19:19:09.353568"]]

	def remove
		f1 = Friendship.where(user_id: current_user.id , friend_id: params[:friend_id].to_i , accept: true).destroy_all
---
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["friend_id", 2], ["accept", "t"]]

	def accept
		f_id = params[:friend_id].to_i
		fs = Friendship.where(user_id: f_id , friend_id: current_user.id)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ?  [["user_id", 2], ["friend_id", 1]]

	def reject
		f_id = params[:friend_id].to_i
		fs = Friendship.where(user_id: f_id , friend_id: current_user.id)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ?  [["user_id", 4], ["friend_id", 5]]

	def requests
		#not working
		@ids= Friendship.where(friend_id: current_user.id , accept: nil)
		@friend_request = Array.new
		@ids.each do |i|
			@friend_request.push(User.find(i.user_id))
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" IS NULL  [["friend_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def friends
		@online = false
		f1 = Friendship.where(friend_id: params[:user_id].to_i , accept: true)
		f2 = Friendship.where(user_id: params[:user_id].to_i , accept: true)
		@friends = Array.new
		f1.each do |i|
			@friends.push(User.find(i.user_id))
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 1], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  	def newsfeed
  		#all my posts and my friends posts sorted by create_at
  		my_posts = current_user.posts()
  		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		friends = Array.new
		f1.each do |i|
			friends.push(User.find(i.user_id))
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 1], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["accept", "t"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  	def quotes
  		#all my quotes and my friends posts sorted by create_at
  		my_posts = current_user.posts().where(genre: "quote")
  		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		friends = Array.new
		f1.each do |i|
			friends.push(User.find(i.user_id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."genre" = ?  [["user_id", 1], ["genre", "quote"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 1], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  	def reviews
  		my_posts = current_user.posts().where(genre: "review")
  		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		friends = Array.new
		f1.each do |i|
			friends.push(User.find(i.user_id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."genre" = ?  [["user_id", 1], ["genre", "review"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 1], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  	def status
  		my_posts = current_user.posts().where(genre: "status")
  		f1 = Friendship.where(friend_id: current_user.id , accept: true)
		f2 = Friendship.where(user_id: current_user.id , accept: true)
		friends = Array.new
		f1.each do |i|
			friends.push(User.find(i.user_id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."genre" = ?  [["user_id", 1], ["genre", "status"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = ? AND "friendships"."accept" = ?  [["friend_id", 1], ["accept", "t"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."accept" = ?  [["user_id", 1], ["accept", "t"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]